src/Documents/РегистрацияВходящегоНалоговогоДокумента/РегистрацияВходящегоНалоговогоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияВходящегоНалоговогоДокумента</name>
  <registerRecords>AccumulationRegister.НДСУсловныеПродажи</registerRecords>
  <registerRecords>AccumulationRegister.НДССоставПоставкиДляРегистрацииВходящихНалоговыхДокументов</registerRecords>
  <registerRecords>AccumulationRegister.НДСРеестрПолученныхНалоговыхДокументов</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетПроверкиВключенияВЕдиныйРеестрНалоговыхНакладных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВключенияВЕдиныйРеестрНалоговыхНакладных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректируемогоВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКорректируемогоВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеКорректировки</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключаетсяВУточняющийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузкиОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецРежимНалогообложения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоВводуОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Переоценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозвратнойТары</name>
    <comment>Сумма возвратной тары (в гривнях)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеXML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Звит1С_DOC_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточняемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВПриложение8Декларации</name>
    <comment>0 - не включать; 1 - включать в таблицу 1; 2 - включать в таблицу 2</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНарушенияПриложение8Декларации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыДокОтказаПриложение8Декларации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПриложение8Декларации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма7Приложение8Декларации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСПриложение8Декларации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС7Приложение8Декларации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма14Приложение8Декларации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС14Приложение8Декларации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Поставка</name>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Амортизируется</name>
      <comment>Поставка Основных фондов. Исользуется для запонения Приложения 5 к Декларации по НДС (с 2008 г)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСПропорционально</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДекларацииНДСНалоговыйКредит</name>
      <type>
        <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПоступлениеУслугПрочихАктивов</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПоставки</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.ВводОстатков</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПоступлениеУслугПрочихАктивов</types>
        <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РегистрацияВходящегоНалоговогоДокумента/Forms/ВходящиеНалоговыеДокументы/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
    
	ОбновитьДатуАктуальностиРасчетовСервер();
	
	// По умолчанию отбор по контрагенту, может быть переопределен в ПриЗагрузкеДанныхИзНастроекНаСервере
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	НастроитьЭлементыФормы();
	УстановитьПараметрыДинамическихСписков();
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеОтчетыИОбработкиКлиентСервер.ТипФормыСписка());
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// МенюОтчеты
	МенюОтчеты.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюОтчеты,, Ложь);
	// Конец МенюОтчеты
	
	ВводНаОсновании.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюСоздатьНаОсновании);

	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
   
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		ОрганизацияПоУмолчанию = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	НастроитьЭлементыФормы();
	УстановитьПараметрыДинамическихСписков();
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_РегистрацияВходящегоНалоговогоДокумента" Тогда
		Элементы.КОформлению.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрагентаПартнераПоУмолчанию()
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПартнерПриИзменении(Элемент)
	
	Если Партнер = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка") 
	   И ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	   
	ИначеЕсли Партнер = ПредопределенноеЗначение("Справочник.Партнеры.НашеПредприятие") 
	   И ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Организации")  Тогда
		Контрагент = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	Иначе	
		ЗаполнитьКонтрагентаПартнераПоУмолчанию();
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьДатуАктуальностиРасчетовСервер();
	Элементы.КОформлению.Обновить();
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодВариантПриИзменении(Элемент)
	
	УстановитьПараметрыДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	
	УстановитьПараметрыДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	
	УстановитьПараметрыДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура КОформлениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элемент.ТекущиеДанные;
		
	Отбор = Новый Структура("Период, Организация, Партнер, Контрагент");
	ЗаполнитьЗначенияСвойств(Отбор, ТекущиеДанные);
	Отбор.Период = Новый СтандартныйПериод(ТекущиеДанные.Период, ТекущиеДанные.Период);
	Если Не ЗначениеЗаполнено(Отбор.Организация) Тогда
		Отбор.Организация = ОрганизацияПоУмолчанию;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, КлючНазначенияИспользования",
		Отбор, 
		Истина,
		Новый УникальныйИдентификатор // Не используем сохраненные пользователем настроки, только заданные в СКД по умолчанию
	);
	ОткрытьФорму("Отчет.НДСАнализНалоговогоКредита.Форма", ПараметрыФормы, ЭтаФорма, , ВариантОткрытияОкна.ОтдельноеОкно); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец МенюОтчеты

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДатуАктуальностиРасчетов(Команда)
	
	ОбновитьДатуАктуальностиРасчетовСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьРасчеты(Команда)
	
	ДополнительныеСвойства = Новый Структура();
	Оповещение = Новый ОписаниеОповещения("АктуализироватьРасчетыПродолжение", ЭтотОбъект, ДополнительныеСвойства);
	
	ТекстВопроса = НСтр("ru='Актуализировать расчеты с поставщиками?';uk='Актуалізувати розрахунки з постачальниками?'");
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьРасчетыПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	АктуализироватьРасчетыСервер();
	
	Элементы.КОформлению.Обновить();	
	
	ПоказатьОповещениеПользователя(
		НСтр("ru='Актуализация расчетов';uk='Актуалізація розрахунків'"),
		,
		НСтр("ru='Расчеты с поставщиками актуализированы. Список актуален до ';uk='Розрахунки з постачальниками актуалізовані. Список актуальний до '") + Формат(ДатаАктуальностиРасчетов, "ДФ=dd.MM.yyyy; ДП='Нет данных'"),
		БиблиотекаКартинок.Информация32
	);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНалоговыйДокумент(Команда)
	
	ТекущиеДанные = Элементы.КОформлению.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ОбновитьДатуАктуальностиРасчетовСервер();
	
	Основание = Новый Структура("Партнер, Контрагент, Организация, Договор, НаправлениеДеятельности, ВидПоставки");
	ЗаполнитьЗначенияСвойств(Основание, ТекущиеДанные);
	Основание.Вставить("ДатаВходящегоДокумента", ТекущиеДанные.Период);
	Если Не ЗначениеЗаполнено(Основание.Организация) Тогда
		Основание.Организация = ОрганизацияПоУмолчанию;
	КонецЕсли;
	
	Если КонецДня(ДатаАктуальностиРасчетов) <= КонецДня(ТекущиеДанные.Период) Тогда
		
		ДополнительныеСвойства = Новый Структура("Основание", Основание);
		Оповещение = Новый ОписаниеОповещения("СоздатьНалоговыйДокументПродолжение", ЭтотОбъект, ДополнительныеСвойства);
		
		ПоказатьВопрос(Оповещение,
			НСтр("ru='Внимание! Список налоговых документов к оформлению не актуален на ';uk='Увага! Список податкових документів до оформлення не актуальний на '")+Формат(ТекущиеДанные.Период, "ДФ=dd.MM.yyyy") + НСтр("ru='
                       |Продолжить?'
                       |;uk='
                       |Продовжити?'"),
			РежимДиалогаВопрос.ОКОтмена,
			,
			КодВозвратаДиалога.Отмена,
			НСтр("ru='Список не актуален';uk='Список не актуальний'")
		);
		
	Иначе
		
		СоздатьНалоговыйДокументЗавершение(Основание);
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНалоговыйДокументПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьНалоговыйДокументЗавершение(ДополнительныеПараметры.Основание);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНалоговыйДокументЗавершение(Основание)
	
	ОткрытьФорму("Документ.РегистрацияВходящегоНалоговогоДокумента.ФормаОбъекта", Новый Структура("Основание", Основание), Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаВходящихНалоговыхДокументовИЗЗвит1С(Команда)
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуЗагрузкиВходящихНалоговыхДокументов();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыФормы()

	Если Партнер = Справочники.Партнеры.НашеПредприятие Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
	Иначе
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	КонецЕсли;
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Контрагент", "ОграничениеТипа", ОписаниеТипа);
	
	ЦветДатыАктуальностиРасчетов = ?(ДатаАктуальностиРасчетов < КонецДня(ТекущаяДата()+1), ЦветаСтиля.ПоясняющийОшибкуТекст, ЦветаСтиля.ПоясняющийТекст);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаАктуальностиРасчетов", "ЦветТекстаЗаголовка", ЦветДатыАктуальностиРасчетов);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаАктуальностиРасчетов", "ЦветТекста", ЦветДатыАктуальностиРасчетов);
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьДатуАктуальностиРасчетовСервер()
	
	ПредварительнаяДата = КонецДня(ТекущаяДата()) + 1; // Как и для исходящего, на начало следующего дня
	
	ДатаАктуальностиРасчетов = НДСВходящийСервер.ОпределитьГраницуАктуальностиФормированияНалоговыхДокументов(ПредварительнаяДата);
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическихСписков()
	
	ДатаНачала    = Период.ДатаНачала;
	ДатаОкончания = КонецДня(?(ЗначениеЗаполнено(Период.ДатаОкончания),Период.ДатаОкончания,'39991231'));
	
	КОформлению.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаНачала);
	КОформлению.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ДатаОкончания);
	
КонецПроцедуры

// Процедура устанавливает отбор динамических списков формы.
//
&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", Организация, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Организация));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Партнер",     Партнер,     ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Партнер));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Контрагент",  Контрагент,  ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Контрагент));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КОформлению.Отбор, "Организация", Организация, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Организация));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КОформлению.Отбор, "Партнер",     Партнер,     ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Партнер));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КОформлению.Отбор, "Контрагент",  Контрагент,  ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Контрагент));
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьРасчетыСервер()
	
	ОкончаниеПериодаРасчета = КонецМесяца(ТекущаяДатаСеанса()) + 1;
	РаспределениеВзаиморасчетов.РаспределитьВсеРасчетыСПоставщиками(ОкончаниеПериодаРасчета);
	
	ОбновитьДатуАктуальностиРасчетовСервер();	
	
КонецПроцедуры

#КонецОбласти
